{"data":{"site":{"siteMetadata":{"title":"Blog by Valerii Maltsev","subtitle":"\n      all(identity, [Write JavaScript, share knowladge, develop web applications])\n    ","copyright":"","menu":[{"label":"Articles","path":"/"},{"label":"What have I done","path":"/what-have-i-done/"}],"author":{"name":"Valerii Maltsev","email":"valmal24.work@gmail.com","telegram":"#","twitter":"valeriimaltsev","github":"ValeriiMal","rss":"#","vk":"#"}}},"markdownRemark":{"id":"063f69ce-9fab-5121-8056-e7964bf50255","html":"<p>Among long list of stupid things and lot of wasted time there are still\nsomething I can speak about</p>\n<p>As far as projects is not as interesting as developers like to think I would start from other\nstuff ).</p>\n<p>Things that I proud of:</p>\n<ul>\n<li>my super wife Tonia, she is my super star and the most lovely creature in the world</li>\n<li>cat Kuzia, it is girl and she is very funny and angry</li>\n<li>I’m from village in the center of Ukraine and managed to finish the best Ukrainian technical\nuniversity and obtain masters degree. Later I realized and felt that studying at university is\nrather like training your brain than obtaining a job</li>\n<li>I started to work directly with clients rather than on a big dev firm with lot of management stuff\nbetween developers and clients</li>\n</ul>\n<p>Things that I like to do:</p>\n<ul>\n<li>I like refactor code. I’m enjoin the look of code with lot of reusability and lot of little\nfunctions =) I’m not ready to say that I position myself as a functional language developer, but\nsomewhy I like to bring a bit of functional stuff to the code.</li>\n<li>I like nice commits</li>\n<li>I prefer couple of simple APIs to one huge API if we talk about libraries</li>\n<li>I like data separated from functionality</li>\n<li>I like to learn something as needed and not because everybody interested in it</li>\n<li>I like learn from reading rather than lern from videos just because it is quicker for me</li>\n</ul>\n<p>There are about 10 projects I successfully grew from scratch and supported in rapid development and\nproduction stages. Among them the most valuable for me are:</p>\n<ul>\n<li>Customer Engagement Management System - project for managing people resources built with\nAngular 1.6 and Twitter Bootstrap from scratch. It was built for huge financial company CIS by Deloitte.\nI consider this one like my programming school that takes me like a little child, teaches me the bast practices imagination, petience and team colaboration, and throw me then to a huge world of web development.</li>\n<li><a href=\"https://staxter.com\">Staxter</a> - This is e-commerce platform, digital transformer that helps\npeople send money of other currency stuff to other people in a second. There is lot of other\nuseful features. This is my playground as one of the main frontend web developer.</li>\n<li><a href=\"https://tika.ai\">Tika</a> - This is my first project where I started to work as single frontend\ndeveloper. Also I bring my rules here and it is fun because I have my little kingdom here =)</li>\n</ul>\n<p>This is my three big schools of project development.</p>","frontmatter":{"title":"What have I done","date":null,"description":null}}},"pageContext":{"slug":"/what-have-i-done"}}